base/Documents/бит_ОтражениеФактаДДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>бит_ОтражениеФактаДДС</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НеСинхронизировать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РасходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.СписаниеБезналичныхДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетБанкаПоОперациямЭквайринга</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеБезналичныхДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сценарий</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.бит_СценарииПланирования</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачатПереходНаНовуюАрхитектуру</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьКурсДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьКратностьДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьХозяйственнаяОперация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_УдалитьХозяйственныеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеСинхронизироватьСумму</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеСинхронизироватьПериод</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ФактическиеДанные</Name>
					<Comment>Фактические данные</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Период</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦФО</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяОборотов</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_СтатьиОборотов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика_1</Name>
							<Comment>Дополнительная аналитика № 1</Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика_2</Name>
							<Comment>Дополнительная аналитика № 2</Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика_3</Name>
							<Comment>Дополнительная аналитика № 3</Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика_4</Name>
							<Comment>Дополнительная аналитика № 4</Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика_5</Name>
							<Comment>Дополнительная аналитика № 5</Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика_6</Name>
							<Comment>Дополнительная аналитика № 6</Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика_7</Name>
							<Comment>Дополнительная аналитика № 7</Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика_8</Name>
							<Comment>Дополнительная аналитика № 8</Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика_9</Name>
							<Comment>Дополнительная аналитика № 9</Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика_10</Name>
							<Comment>Дополнительная аналитика № 10</Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика_11</Name>
							<Comment>Дополнительная аналитика № 11</Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика_12</Name>
							<Comment>Дополнительная аналитика № 12</Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Позиция</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.бит_кзн_ПозицияПоступления</v8:Type>
								<v8:Type>cfg:DocumentRef.бит_кзн_ПлатежнаяПозиция</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Заблокировать</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаОплаты</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаВзаиморасчетов</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВалютаВзаиморасчетов</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КурсЧислительВзаиморасчетов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КурсЗнаменательВзаиморасчетов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Аналитики</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Аналитика</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.бит_ВидыДополнительныхАналитик</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеАналитики</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НаборыЗначенийДоступа</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НомерНабора</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеДоступа</Name>
							<Comment>Незаполненные значения нужно допустить, чтобы избежать ошибок при записи проверяемых объектов</Comment>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЗначениеДоступа</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Уточнение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Чтение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Изменение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

base/InformationRegisters/бит_ДополнительныеАналитики.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бит_ДополнительныеАналитики</Name>
			<Comment>(БИТ)</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗначениеАналитики</Name>
					<Comment>Значение аналитики</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Comment>Объект</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.бит_ВладелецДополнительныхАналитик</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Аналитика</Name>
					<Comment>Аналитика</Comment>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.бит_ВидыДополнительныхАналитик</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

base/Catalogs/бит_КлючиДоступаЦФОСтатьиОборотов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>бит_КлючиДоступаЦФОСтатьиОборотов</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЦФО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяОборотов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СтатьиОборотов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ГруппыДоступа</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ГруппаДоступа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ГруппыКлючейДоступаЦФОСтатьиОборотов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

base/Documents/бит_ОтражениеФактаДДС/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// См. УправлениеДоступом.ЗаполнитьНаборыЗначенийДоступа.
//
Процедура ЗаполнитьНаборыЗначенийДоступа(Таблица) Экспорт

	УстановитьПривилегированныйРежим(Истина);
	
	Если ФактическиеДанные.Количество() = 0 Тогда
	
		Строка = Таблица.Добавить();
		Строка.ЗначениеДоступа = Перечисления.ДополнительныеЗначенияДоступа.ДоступРазрешен;
		
	Иначе
		
		// Таблица "Фактические данные"
		Для каждого СтрокаТаблицы Из ФактическиеДанные Цикл
			КлючДоступаЦФОСтатьяОборотов = Справочники.бит_КлючиДоступаЦФОСтатьиОборотов.КлючиЦФОСтатьяОборотовДокумента(
				СтрокаТаблицы.ЦФО, СтрокаТаблицы.СтатьяОборотов);
			ДобавитьСтрокуВНаборЗначенийДоступа(КлючДоступаЦФОСтатьяОборотов, Таблица);
		КонецЦикла; 
				
		// Удалим дубли
		ПоляГруппировки = "";
		Для каждого Колонка Из Таблица.Колонки Цикл
			ПоляГруппировки = "," + Колонка.Имя + ПоляГруппировки;
		КонецЦикла; 
		
		ПоляГруппировки = Сред(ПоляГруппировки, 2);
		Таблица.Свернуть(ПоляГруппировки);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Основание = Неопределено;
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		бит_ОбщегоНазначения.ЗаполнитьПоСтруктуре(ЭтотОбъект, ДанныеЗаполнения);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Сценарий) И ДанныеЗаполнения <> Неопределено Тогда
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДанныеЗаполнения, "Дата") Тогда
			ДатаЗаполнения = ДанныеЗаполнения.Дата;
			Если НЕ ЗначениеЗаполнено(ДатаЗаполнения) Тогда
				ДатаЗаполнения = ТекущаяДатаСеанса();	
			КонецЕсли;
		КонецЕсли;
		
		Параметры = Новый Структура;
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДанныеЗаполнения, "Организация") Тогда
			Параметры.Вставить("Организация", ДанныеЗаполнения.Организация);	
		КонецЕсли;
		
		СценарийКандидат = бит_НастройкиПрограммы.СценарийОтраженияФактаБДДС(Параметры, ДатаЗаполнения);	
		Если НЕ ЗначениеЗаполнено(СценарийКандидат) Тогда
			СценарийКандидат = Справочники.СценарииПланирования.ФАКТ;		
		КонецЕсли;
		Сценарий = СценарийКандидат;
	КонецЕсли; 
	
	Если НЕ ЗначениеЗаполнено(Дата) Тогда
		Дата = ТекущаяДатаСеанса();	
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ДатаЗаполнения) Тогда
		ДатаЗаполнения = ТекущаяДатаСеанса();
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Сценарий) Тогда
		Сценарий = Справочники.СценарииПланирования.ФАКТ;
	КонецЕсли;
	
	Ответственный = Пользователи.ТекущийПользователь();
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)

	НепроверяемыеРеквизиты = Новый Массив();
	Если НЕ НачатПереходНаНовуюАрхитектуру Тогда
		НепроверяемыеРеквизиты.Добавить("УдалитьКурсДокумента");
		НепроверяемыеРеквизиты.Добавить("УдалитьКратностьДокумента");	
	КонецЕсли;
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, НепроверяемыеРеквизиты);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли; 
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	бит_ОбщегоНазначенияПереопределяемый.ПередЗаписьюДокумента(ЭтотОбъект, РежимЗаписи, РежимПроведения);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ЗавершитьПереходНаНовуюАрхитектуру();

	
	Для каждого СтрокаТаблицы Из ФактическиеДанные Цикл
		Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.Позиция) Тогда
			СтрокаТаблицы.Позиция = Неопределено;
		КонецЕсли;
	КонецЦикла;
		
	СуммаДокумента = ФактическиеДанные.Итог("СуммаОплаты");
	
	бит_Бюджетирование.ОчиститьНеИспользуемыеАналитикиСтатейОборотов(ФактическиеДанные);
	
	// Очищаем не заполненные данные составного типа.
	КонтролируемыеКолонки = Новый Массив;
	КонтролируемыеКолонки.Добавить("Позиция");
	
	ВсегоКолонок = 12;
	Для НомерКолонки = 1 По ВсегоКолонок Цикл
		КонтролируемыеКолонки.Добавить("Аналитика_" + НомерКолонки);
	КонецЦикла;
	
	Для каждого СтрокаТаблицы Из ФактическиеДанные Цикл
		Для каждого Колонка Из КонтролируемыеКолонки Цикл
			Если НЕ ЗначениеЗаполнено(СтрокаТаблицы[Колонка]) Тогда
				СтрокаТаблицы[Колонка] = Неопределено;			
			КонецЕсли;	
		КонецЦикла;
	КонецЦикла;
	
	Для каждого СтрокаТаблицы Из Аналитики Цикл
		Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.ЗначениеАналитики) Тогда
			СтрокаТаблицы.ЗначениеАналитики = Неопределено;			
		КонецЕсли;	
	КонецЦикла;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли; 
	
	Если Отказ Тогда
		 Возврат;
	КонецЕсли; 
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.бит_ДополнительныеАналитики");
	ЭлементБлокировки.УстановитьЗначение("Объект", ДокументОснование);
	Блокировка.Заблокировать();

	// Запишем аналитики в РС.бит_ДополнительныеАналитики, 
	// т.к. именно он используется в МХО и МеханизмеТрансляции.
	НаборАналитики = РегистрыСведений.бит_ДополнительныеАналитики.СоздатьНаборЗаписей();
	НаборАналитики.Отбор.Объект.Установить(ДокументОснование);
	НаборАналитики.Прочитать();
	
	НаборАналитики.Очистить();
	
	Если НЕ ПометкаУдаления Тогда
		Для каждого СтрокаТаблицы Из Аналитики Цикл
			Запись = НаборАналитики.Добавить();
			Запись.Объект = ДокументОснование;
			Запись.Аналитика = СтрокаТаблицы.Аналитика;
			Запись.ЗначениеАналитики = СтрокаТаблицы.ЗначениеАналитики
		КонецЦикла; 
	КонецЕсли; 
	
	НаборАналитики.Записать();
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Процедура проводит отражение движений денежных средств. 
//
// Параметры:
//  Отражение - ДокументСсылка.бит_ОтражениеДДС.
//  Отказ     - Булево.
//
Процедура ПровестиОтражениеДДС(Отражение, Отказ) Экспорт

	Если Отказ Тогда
		Возврат;
	КонецЕсли; 

	Если НЕ ЗначениеЗаполнено(Отражение.ДокументОснование) Тогда
		Возврат;
	КонецЕсли; 
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Регистратором является типовой первичный документ.
	Источник = Отражение.ДокументОснование.ПолучитьОбъект();
	
	бит_ОбщегоНазначенияПереопределяемый.ПередЗаписьюДокумента(Источник, РежимЗаписиДокумента.Запись, 
		РежимПроведенияДокумента.Неоперативный);
		
	// Автоматический сбор факта по бюджету.
	Документы.бит_ОтражениеФактаДДС.ДвиженияПоРегистрамОтраженияДДС(Источник, Отказ, Истина);

	// Механизм трансляции
	бит_МеханизмТрансляции.ВыполнитьТрансляцию(Источник, , , Истина);
	
	// Мезанизм хозяйственных операций.
	бит_МеханизмХозяйственныхОперацийСервер.бит_мхо_НастраиваемыеДвиженияДокументовОбработкаПроведения(Источник, Отказ, РежимПроведенияДокумента.Неоперативный);
		
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры // ПровестиОтражениеДДС()

Процедура ОбработатьПриЗаписиДокументаДДС(Источник) Экспорт
	
	РеквизитыОснования = Документы.бит_ОтражениеФактаДДС.РеквизитыОснования(Источник);
	РасшифровкаПлатежа = РеквизитыОснования.РасшифровкаПлатежа;	
	
	Если РеквизитыОснования.ПометкаУдаления <> ПометкаУдаления Тогда
		УстановитьПометкуУдаления(РеквизитыОснования.ПометкаУдаления);
	КонецЕсли; 
		
	ЗаполнитьПоОснованию(Источник);

	Если НеСинхронизироватьСумму = Ложь И ФактическиеДанные.Количество() = 1 Тогда
		СтрокаТаблицы = ФактическиеДанные[0];
		СтрокаТаблицы.СуммаОплаты = РеквизитыОснования.СуммаДокумента;
							
		Если НЕ ЗначениеЗаполнено(РасшифровкаПлатежа) Тогда
			СтрокаТаблицы.Сумма = Источник.СуммаДокумента;	
		Иначе
			ИтогоСуммаВзаиморасчетов = РасшифровкаПлатежа.Итог("СуммаВзаиморасчетов");
			ИтогоСумма				 = РасшифровкаПлатежа.Итог("СуммаОплаты");
			СтрокаТаблицы.Сумма		 = ИтогоСумма;
		КонецЕсли;
		Если СтрокаТаблицы.СуммаОплаты <> СтрокаТаблицы.Сумма И СтрокаТаблицы.СуммаОплаты <> 0 И СтрокаТаблицы.Сумма <> 0  Тогда
			// Рассчеты в у.е.
			УдалитьКурсДокумента = ОКР(СтрокаТаблицы.СуммаОплаты / СтрокаТаблицы.Сумма, 4);  
		КонецЕсли;
	КонецЕсли; 
	
	Если НЕ НеСинхронизироватьПериод Тогда
		РеквизитыОснования = Документы.бит_ОтражениеФактаДДС.РеквизитыОснования(Источник.Ссылка);
	   	Период = РеквизитыОснования.Период;
		Для каждого СтрокаТаблицы Из ФактическиеДанные Цикл
			СтрокаТаблицы.Период = Период;
		КонецЦикла; 
	КонецЕсли;
	
КонецПроцедуры
 
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьПоОснованию(Основание)

	Если НЕ Метаданные().Реквизиты.ДокументОснование.Тип.СодержитТип(ТипЗнч(Основание)) Тогда
		ТекстСообщения = НСтр("ru = 'Ввод на основании %1 не поддерживается.'; en = 'Input based on %1 is not supported.'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, Основание);
		ВызватьИсключение ТекстСообщения;
	КонецЕсли;
	
	РеквизитыОснования = Документы.бит_ОтражениеФактаДДС.РеквизитыОснования(Основание);
	ДокументОснование  = РеквизитыОснования.Ссылка;
	ВалютаДокумента    = РеквизитыОснования.Валюта;

	УстановитьДатуДокумента(РеквизитыОснования);
	
	Если НЕ НеСинхронизировать Тогда
		Документы.бит_ОтражениеФактаДДС.ЗаполнитьАналитикиФактическихДанных(ЭтотОбъект, РеквизитыОснования);
		Документы.бит_ОтражениеФактаДДС.ЗаполнитьАналитикиШапкиПоФактическимДанным(Основание.Метаданные(), ФактическиеДанные, Аналитики);
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьСтрокуВНаборЗначенийДоступа(ЗначениеДоступа, Таблица)
	
	СтрокаТаб = Таблица.Добавить();
	Если ЗначениеЗаполнено(ЗначениеДоступа) Тогда			
		СтрокаТаб.ЗначениеДоступа = ЗначениеДоступа;
	Иначе
		СтрокаТаб.ЗначениеДоступа = Перечисления.ДополнительныеЗначенияДоступа.ДоступРазрешен;
	КонецЕсли; 

КонецПроцедуры

Процедура УстановитьДатуДокумента(РеквизитыОснования)
	
	ТекущаяДата = Дата;
	Дата		= РеквизитыОснования.Период;
	
	Если НачалоГода(ТекущаяДата) <> НачалоГода(Дата) Тогда
		УстановитьНовыйНомер();	
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗавершитьПереходНаНовуюАрхитектуру()
	
	Перем ВсеСтрокиПривязаны, РеквизитыОснования, СтрокаТаблицы;
	
	Если НЕ НачатПереходНаНовуюАрхитектуру Тогда
		Возврат;
	КонецЕсли;
	
	ВсеСтрокиПривязаны = Истина;
	РеквизитыОснования = Документы.бит_ОтражениеФактаДДС.РеквизитыОснования(ДокументОснование);
	Для каждого СтрокаТаблицы Из ФактическиеДанные Цикл
		ПараметрыПоиска = Новый Структура("ИдентификаторСтроки", СтрокаТаблицы.ИдентификаторСтроки);
		РезультатПоиска = РеквизитыОснования.РасшифровкаПлатежа.НайтиСтроки(ПараметрыПоиска);
		Если НЕ ЗначениеЗаполнено(РезультатПоиска) Тогда
			ВсеСтрокиПривязаны = Ложь;			
		КонецЕсли;
	КонецЦикла;

	Если НЕ ВсеСтрокиПривязаны Тогда
		НачатПереходНаНовуюАрхитектуру = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Иначе
  ВызватьИсключение НСтр("ru='Недопустимый вызов объекта на клиенте.';en='Invalid object call on client'");
#КонецЕсли
